
#include <stdio.h>

/*
Шифр Цезаря
На стандартном потоке ввода задается целое неотрицательное число N и последовательность допустимых символов в кодировке ASCII, оканчивающаяся точкой. Допустимые символы - латинские буквы 'a' ... 'z', 'A' ... 'Z' и пробел. Требуется закодировать латинские буквы ('a' ... 'z', 'A' ... 'Z') шифром Цезаря, пробелы вывести без изменения. Число N задает сдвиг в шифре. Шифр Цезаря заключается в следующем преобразовании. Пусть буквы алфавита пронумерованы от 0 до K - 1, где K - число символов в алфавите. Тогда символ с номером n кодируется символом с номером p = (n + N) mod K (mod - операция взятия остатка). На стандартном потоке вывода напечатать зашифрованное сообщение, оканчивающееся точкой. Преобразование требуется выполнять независимо для заглавных и строчных латинских букв. Указание: использовать массивы запрещается.
*/

#include <stdio.h>

int main()
{
    int n;

    if (scanf("%d", &n) != 1 || n < 0)
    {
        return 1;
    }
    // Нормализуем сдвиг по размеру алфавита (26 букв)для обработки больших значения сдвига без лишних циклов
    n = n % 26;

    char ch;
    // Читаем по одному символу без пропуска пробелов перед ним пока не встретим точку
    while (scanf("%c", &ch) == 1)
    {
        if (ch == '.')
        {
            putchar('.');
            break;
        }

        // Обрабатываем строчные буквы 'a'...'z'
        if (ch >= 'a' && ch <= 'z')
        {
            int offset = ch - 'a'; // номер буквы от 0 до 25
            int encoded_offset = (offset + n) % 26; // формула шифра Цезаря
            putchar('a' + encoded_offset); // обратно в символ
        }
        
        // Обрабатываем заглавные буквы 'A'...'Z'
        else if (ch >= 'A' && ch <= 'Z')
        {
            int offset = ch - 'A';
            int encoded_offset = (offset + n) % 26;
            putchar('A' + encoded_offset);
        }

        // Пробелы, и любые другие символы кроме точки - без изменений
        else
        {
            putchar(ch);
        }
    }

    return 0;
}
