#include <stdio.h>
#include <stdint.h>
#include <inttypes.h>

/*
Инверсия старших
На вход программе подается беззнаковое 32-битное целое число N. Требуется изменить значения всех битов старшего байта числа на противоположные и вывести полученное таким образом число.
 */

int main()
{
    uint32_t n;

    // Читаем число N
    if (scanf("%" SCNu32, &n) != 1)
    {
        return 1;
    }

    // Старший байт — это биты с 24 по 31 (считая с 0).
    // Создаём маску, где единицы только в старшем байте, а остальные биты — нули.: 0xFF000000 
    const uint32_t high_byte_mask = 0xFFu << 24; //Маска объявлена как const, чтобы случайно не изменить её в коде и показать, что это фиксированное значение. Суффикс u делает число 0xFF беззнаковым. Сдвиг влево на 24 бита, после него 8 единиц оказываются в позициях 24–31.

    // Инвертируем только старший байт: XOR с маской
    uint32_t result = n ^ high_byte_mask;

    printf("%" PRIu32 "\n", result);
    return 0;
}


