#include <stdio.h>
#include <stdint.h>
#include <inttypes.h>

/*
Не пара
Преподаватели Geek Brains создали набор, содержащий N (1 ≤ N ≤ 1 000 000) натуральных чисел, не превосходящих 1 000 000. Известно, что ровно одно число в этом наборе встречается один раз, а остальные — ровно по два раза. Помогите им найти это число. Входныеданные: в первой входной строке вводится число N, затем по одному числу в строке вводятся N натуральных чисел, не превосходящих 2000 000 000. Выходные данные: ваша программа должна определить число, встречающееся один раз, и вывести его на экран. Указание: использовать массивы запрещается.
 */

int main()
{
    int n;
    if (scanf("%d", &n) != 1) // Проверяем что считано одно значение
    {
        return 1;
    }

    uint32_t result = 0; // Переменная result будет хранить промежуточный результат побитового XOR
    uint32_t x;

// Чтение чисел в цикле и накопление XOR
    for (int i = 0; i < n; ++i)
    {
        if (scanf("%" SCNu32, &x) != 1) //проверка корректности чисел
        {
            return 1;
        }
        result ^= x;  // накапливаем XOR всех прочитанных чисел
    }

    printf("%" PRIu32 "\n", result); // Вывод результата
    return 0;
}

