#include <stdio.h>
#include <stdint.h>
#include <inttypes.h>

/*
Подсчет битов
На вход программе подается беззнаковое 32-битное целое число N. Требуется найти количество единичных битов в двоичном представлении данного числа.
 */

int main()
{
    uint32_t n;

    // Читаем число N
    if (scanf("%" SCNu32, &n) != 1)
    {
        return 1;
    }

    int count = 0;

    // Используем для подсчета цикл с алгоритмом Брайана Кернигана. Пока в числе есть единицы, убираем младший единичный бит
    while (n != 0)
    {
        n &= (n - 1);   // эта операция убирает младший установленный бит
        ++count;       // считаем, сколько раз мы это сделали
    }
    // Вариант с перебором всех битов числа. Здесь мы сдвигаем n вправо на i позиций и проверяем младший бит через & 1
    /*
    int count = 0;
    for (int i = 0; i < 32; ++i) {
        if ((n >> i) & 1U) {
            ++count;
        }
    */
    printf("%" PRIu32 "\n", (uint32_t)count);
    return 0;
}
