#include <stdio.h>

/*Сколько раз встречается максимум
На стандартном потоке ввода задаётся натуральное число N (N > 0), после которого следует последовательность из N целых чисел.На стандартный поток вывода напечатайте, сколько раз в этой последовательности встречается максимум. Указание: использовать массивы запрещается.
*/

int main() {
    int n;

    // Читаем количество чисел  в последовательности (первое число)
    if (scanf("%d", &n) != 1 || n <= 0) 
    {
        return 1; // некорректный ввод числа n
    }

    int current;
    int max_val;
    int count = 0;

    // Обрабатываем числа без использования массивов
    for (int i = 0; i < n; ++i) 
    {
        if (scanf("%d", &current) != 1) 
        {
            return 1; // ошибка ввода
        }

        if (i == 0) 
        {
            // Принимаем первый элемент за максимум
            max_val = current;
            count = 1;
        } else 
        {
            if (current > max_val) 
            {
                // Если найден новый максимум — сбрасываем счётчик
                max_val = current;
                count = 1;
            } else if (current == max_val) 
            {
                // Встретили текущий максимум ещё раз - увеличиваем счетчик
                count++;
            }
        }
    }
    // Печатаем количество максимумов
    printf("%d\n", count);
    return 0;
}


